Диплом_ЖТГ/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтавкаЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Диплом_ЖТГ/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Диплом_ЖТГ/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Добавление полей
	ВКМ_ГруппаСрокДоговора = Элементы.Вставить("ВКМ_ГруппаСрокДоговора", Тип("ГруппаФормы"), ЭтотОбъект, );
	ВКМ_ГруппаСрокДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	ВКМ_ДатаНачала = Элементы.Вставить("ВКМ_ДатаНачала", Тип("ПолеФормы"), Элементы.ВКМ_ГруппаСрокДоговора, );
	ВКМ_ДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
	
	ВКМ_ДатаОкончания = Элементы.Вставить("ВКМ_ДатаОкончания", Тип("ПолеФормы"),
	Элементы.ВКМ_ГруппаСрокДоговора, );
	ВКМ_ДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
	
	ВКМ_АбонентскаяПлата = Элементы.Вставить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"), , );
	ВКМ_АбонентскаяПлата.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_АбонентскаяПлата.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
	ВКМ_СтавкаЧаса = Элементы.Вставить("ВКМ_СтавкаЧаса", Тип("ПолеФормы"), , );
	ВКМ_СтавкаЧаса.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтавкаЧаса.ПутьКДанным = "Объект.ВКМ_СтавкаЧаса";
	
	ВидимостьЭлементов();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидимостьЭлементов()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ГруппаСрокДоговора.Видимость = Истина;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Элементы.ВКМ_СтавкаЧаса.Видимость = Истина;
	Иначе
		Элементы.ВКМ_ГруппаСрокДоговора.Видимость = Ложь;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		Элементы.ВКМ_СтавкаЧаса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
